
# เหมือน set {} ใน math  (ข้อมูลในแต่ละสมาชิกไม่สามารถซ้ำกันได้[ซ้ำแต่นับเป็น 1])
# ไม่สามารถแก้ไขสมาขิกในข้อมูลได้ / ไม่มี index ในการอ้างอิง(ลำดับข้อมูลไม่แน่นอน)
# แก้ไขไม่ได้ แต่สามารถลบและเพิ่มข้อมูลได้นะ / ค้นหาข้อมูลได้ไวเพราะไม่ได้เรียงลำดับข้อมูล
# จึงไม่จำเป็นต้องไล่เช็คตั้งแต่ตัวแรกจนถึงตัวสุดท้าย

#การสร้าง set {}
name = {"mu","aom","mumond"}
print(name)     #ลำดับสมาชิกเปลี่ยนไปตลอด

# print(name[0]) #ไม่มี index ในการอ้างอิง

fish = set(["a","b","a"]) # ข้อมูลซ้ำนับเป็น 1
print(fish)